openFoamFiles/meshes/twoLiquidMixingFine/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  5                                     | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       volScalarField; 
    location     "0"; 
    object      nut; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
 
 
dimensions      [0 2 -1 0 0 0 0]; 
 
internalField   uniform 0.000048; 
 
boundaryField 
{ 
    //- Set patchGroups for constraint patches 
    #includeEtc "caseDicts/setConstraintTypes" 
    inlet 
    { 
        type            calculated;//fixedValue; 
        value           $internalField;
    } 
    outlet 
    { 
       type            zeroGradient; 
    } 
    atmosphere 
	{ 
		type			calculated;//zeroGradient;
        value           $internalField;
	} 
    atmosphereFrontOfBarge 
	{ 
		type			calculated;//zeroGradient;
        value           $internalField;
	} 
	barge 
	{ 
        type            fixedValue;


        value           uniform 1e-9;
   } 
} 
 
// ************************************************************************* // 
