openFoamFiles/meshes/twoLiquidMixingFine/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  5                                     | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       volScalarField; 
    location     "0"; 
    object      omega; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
 
 
dimensions      [0 0 -1 0 0 0 0]; 
 
internalField   uniform 4.472136; 
 
boundaryField 
{ 
    //- Set patchGroups for constraint patches 
    #includeEtc "caseDicts/setConstraintTypes" 
    inlet 
    { 
        type            fixedValue; 
        value           $internalField;
    } 
    outlet 
    { 
       type            inletOutlet; 
       inletValue      $internalField;
       value           $internalField;
    } 
    atmosphere 
	{ 
		type			zeroGradient;
	} 
    atmosphereFrontOfBarge 
	{ 
		type			zeroGradient;
	} 
	barge 
	{ 
        type            omegaWallFunction;
        Cmu             0.09; 
        kappa           0.41; 
        E               9.8; 
        value           $internalField;

   } 
} 
 
// ************************************************************************* // 
