openFoamFiles/meshes/twoLiquidMixingFine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
// SymmetryPlane outlet
(-15.0 0 -4.0) // 0
(-7.5 0 -4.0) //1
(-7.5 0.225 -4.0) //2
(-15.0 0.225 -4.0) //3

(-15.0 0 -2.7) // 4
(-7.5 0 -2.7) //5
(-7.5 0.225 -2.7) //6
(-15.0 0.225 -2.7) //7

(-15.0 0 -1.9) // 8
(-7.5 0 -1.9) //9
(-7.5 0.225 -1.9) //10
(-15.0 0.225 -1.9) //11

(-15.0 0 -1.1) // 12
(-7.5 0 -1.1) //13
(-7.5 0.225 -1.1) //14
(-15.0 0.225 -1.1) //15

(-15.0 0 -0.3) // 16
(-7.5 0 -0.3) //17
(-7.5 0.225 -0.3) //18
(-15.0 0.225 -0.3) //19

(-15.0 0 -0.1) // 20
(-7.5 0 -0.1) //21
(-7.5 0.225 -0.1) //22
(-15.0 0.225 -0.1) //23

(-15.0 0 0.0) // 24
(-7.5 0 0.0) //25
(-7.5 0.225 0.0) //26
(-15.0 0.225 0.0) //27


//width side outlet

(-7.5  3.0 -4.0) //28
(-15.0  3.0 -4.0) //29

(-7.5  3.0 -2.7) //30
(-15.0  3.0 -2.7) //31

(-7.5  3.0 -1.9) //32
(-15.0  3.0 -1.9) //33

(-7.5  3.0 -1.1) //34
(-15.0  3.0 -1.1) //35

(-7.5  3.0 -0.3) //36
(-15.0  3.0 -0.3) //37

(-7.5  3.0 -0.1) //38
(-15.0  3.0 -0.1) //39

(-7.5  3.0 0.0) //40
(-15.0  3.0 0.0) //41

// 
// SymmetryPlane 
(0.0 0 -4.0) // 42
(0.6 0 -4.0) //43
(0.6 0.225 -4.0) //44
(0.0 0.225 -4.0) //45

(0.0 0 -2.7) // 46
(0.6 0 -2.7) //47
(0.6 0.225 -2.7) //48
(0.0 0.225 -2.7) //49

(0.0 0 -1.9) // 50
(0.6 0 -1.9) //51
(0.6 0.225 -1.9) //52
(0.0 0.225 -1.9) //53

(0.0 0 -1.1) // 54
(0.6 0 -1.1) //55
(0.6 0.225 -1.1) //56
(0.0 0.225 -1.1) //57

(0.0 0 -0.3) // 58
(0.6 0 -0.3) //59
(0.6 0.225 -0.3) //60
(0.0 0.225 -0.3) //61

(0.0 0 -0.1) // 62
(0.6 0 -0.1) //63
(0.6 0.225 -0.1) //64
(0.0 0.225 -0.1) //65

(0.0 0 0.0) // 66
(0.6 0 0.0) //67
(0.6 0.225 0.0) //68
(0.0 0.225 0.0) //69



//width side 

(0.6  3.0 -4.0) //70
(0.0  3.0 -4.0) //71

(0.6  3.0 -2.7) //72
(0.0  3.0 -2.7) //73

(0.6  3.0 -1.9) //74
(0.0  3.0 -1.9) //75

(0.6  3.0 -1.1) //76
(0.0  3.0 -1.1) //77

(0.6  3.0 -0.3) //78
(0.0  3.0 -0.3) //79

(0.6  3.0 -0.1) //80
(0.0  3.0 -0.1) //81

(0.6  3.0 0.0) //82
(0.0  3.0 0.0) //83



//
// SymmetryPlane 
(5.5 0 -4.0) // 84
(10.0 0 -4.0) //85
(10.0 0.225 -4.0) //86
(5.5 0.225 -4.0) //87

(5.5 0 -2.7) // 88
(10.0 0 -2.7) //89
(10.0 0.225 -2.7) //90
(5.5 0.225 -2.7) //91

(5.5 0 -1.9) // 92
(10.0 0 -1.9) //93
(10.0 0.225 -1.9) //94
(5.5 0.225 -1.9) //95

(5.5 0 -1.1) // 96
(10.0 0 -1.1) //97
(10.0 0.225 -1.1) //98
(5.5 0.225 -1.1) //99

(5.5 0 -0.3) // 100
(10.0 0 -0.3) //101
(10.0 0.225 -0.3) //102
(5.5 0.225 -0.3) //103

(5.5 0 -0.1) // 104
(10.0 0 -0.1) //105
(10.0 0.225 -0.1) //106
(5.5 0.225 -0.1) //107

(5.5 0 0.0) // 108
(10.0 0 0.0) //109
(10.0 0.225 0.0) //110
(5.5 0.225 0.0) //111



//width side

(10.0  3.0 -4.0) //112
(5.5  3.0 -4.0) //113

(10.0  3.0 -2.7) //114
(5.5  3.0 -2.7) //115

(10.0  3.0 -1.9) //116
(5.5  3.0 -1.9) //117

(10.0  3.0 -1.1) //118
(5.5  3.0 -1.1) //119

(10.0  3.0 -0.3) //120
(5.5  3.0 -0.3) //121

(10.0  3.0 -0.1) //122
(5.5  3.0 -0.1) //123

(10.0  3.0 0.0) //124
(5.5  3.0 0.0) //125



);

blocks
(
hex (  0   1   2   3   4   5   6   7) (13  1  15) simpleGrading (1 1 1) // bottom symmetryPlane outlet
hex (  4   5   6   7   8   9  10  11) (13  1  10) simpleGrading (1 1 1) // 2nd layer symmetryPlane outlet
hex (  8   9  10  11  12  13  14  15) (13  1  10) simpleGrading (1 1 1) // 3rd layer symmetryPlane outlet
hex ( 12  13  14  15  16  17  18  19) (13  1  10) simpleGrading (1 1 1) // 4th layer symmetryPlane outlet
hex ( 16  17  18  19  20  21  22  23) (13  1  10) simpleGrading (1 1 1) // 5th layer symmetryPlane outlet
hex ( 20  21  22  23  24  25  26  27) (13  1   5) simpleGrading (1 1 1) // 6th layer symmetryPlane outlet


hex (  3   2  28  29   7   6  30  31) (13   9  15) simpleGrading (1 1 1) // bottom widthSide outlet
hex (  7   6  30  31  11  10  32  33) (13   9  10) simpleGrading (1 1 1) // 2nd layer widthSide outlet
hex ( 11  10  32  33  15  14  34  35) (13   9  10) simpleGrading (1 1 1) // 3rd layer widthSide outlet
hex ( 15  14  34  35  19  18  36  37) (13   9  10) simpleGrading (1 1 1) // 4th layer widthSide outlet
hex ( 19  18  36  37  23  22  38  39) (13   9  10) simpleGrading (1 1 1) // 5th layer widthSide outlet
hex ( 23  22  38  39  27  26  40  41) (13   9   5) simpleGrading (1 1 1) // 6th layer widthSide outlet


hex (  1  42  45   2   5  46  49   6) (13 1   15) simpleGrading (1 1 1) // bottom symmetryPlane wake
hex (  5  46  49   6   9  50  53  10) (13 1   10) simpleGrading (1 1 1) // 2nd layer symmetryPlane wake
hex (  9  50  53  10  13  54  57  14) (13 1   10) simpleGrading (1 1 1) // 3rd layer symmetryPlane wake
hex ( 13  54  57  14  17  58  61  18) (13 1   10) simpleGrading (1 1 1) // 4th layer symmetryPlane wake
hex ( 17  58  61  18  21  62  65  22) (13 1   10) simpleGrading (1 1 1) // 5th layer symmetryPlane wake
hex ( 21  62  65  22  25  66  69  26) (13 1    5) simpleGrading (1 1 1) // 6th layer symmetryPlane wake


hex (  2  45  71  28   6  49  73  30) (13  9  15) simpleGrading (1 1 1) // bottom widthSide wake
hex (  6  49  73  30  10  53  75  32) (13  9  10) simpleGrading (1 1 1) // 2nd layer widthSide wake
hex ( 10  53  75  32  14  57  77  34) (13  9  10) simpleGrading (1 1 1) // 3rd layer widthSide wake
hex ( 14  57  77  34  18  61  79  36) (13  9  10) simpleGrading (1 1 1) // 4th layer widthSide wake
hex ( 18  61  79  36  22  65  81  38) (13  9  10) simpleGrading (1 1 1) // 5th layer widthSide wake
hex ( 22  65  81  38  26  69  83  40) (13  9   5) simpleGrading (1 1 1) // 6th layer widthSide wake

hex ( 42  43  44  45  46  47  48  49) (1  1  15) simpleGrading (1 1 1) // bottom symmetryPlane barge
hex ( 46  47  48  49  50  51  52  53) (1  1  10) simpleGrading (1 1 1) // 2nd layer symmetryPlane barge
hex ( 50  51  52  53  54  55  56  57) (1  1  10) simpleGrading (1 1 1) // 3rd layer symmetryPlane barge
hex ( 54  55  56  57  58  59  60  61) (1  1  10) simpleGrading (1 1 1) // 4th layer symmetryPlane barge
hex ( 58  59  60  61  62  63  64  65) (1  1  10) simpleGrading (1 1 1) // 5th layer symmetryPlane barge
//hex ( 62  63  64  65  66  67  68  69) (3  3  10) simpleGrading (1 1 1) // 6th layer symmetryPlane barge


hex ( 45  44  70  71  49  48  72  73) (1   9  15) simpleGrading (1 1 1) // bottom widthSide barge
hex ( 49  48  72  73  53  52  74  75) (1   9  10) simpleGrading (1 1 1) // 2nd layer widthSide barge
hex ( 53  52  74  75  57  56  76  77) (1   9  10) simpleGrading (1 1 1) // 3rd layer widthSide barge
hex ( 57  56  76  77  61  60  78  79) (1   9  10) simpleGrading (1 1 1) // 4th layer widthSide barge
hex ( 61  60  78  79  65  64  80  81) (1   9  10) simpleGrading (1 1 1) // 5th layer widthSide barge
hex ( 65  64  80  81  69  68 82   83) (1   9   5) simpleGrading (1 1 1) // 6th layer widthSide barge


hex ( 43  84  87  44  47  88  91  48) (8  1   15) simpleGrading ( 1 1 1) // bottom symmetryPlane frontOfBarge
hex ( 47  88  91  48  51  92  95  52) (8  1   10) simpleGrading ( 1 1 1) // 2nd layer symmetryPlane frontOfBarge
hex ( 51  92  95  52  55  96  99  56) (8  1   10) simpleGrading ( 1 1 1) // 3rd layer symmetryPlane frontOfBarge
hex ( 55  96  99  56  59 100 103  60) (8  1   10) simpleGrading ( 1 1 1) // 4th layer symmetryPlane frontOfBarge
hex ( 59 100 103  60  63 104 107  64) (8  1   10) simpleGrading ( 1 1 1) // 5th layer symmetryPlane frontOfBarge
hex ( 63 104 107  64  67 108 111  68) (8  1    5) simpleGrading ( 1 1 1) // 6th layer symmetryPlane frontOfBarge

hex ( 44  87 113  70  48  91 115  72) (8   9  15) simpleGrading ( 1 1 1) // bottom widthSide frontOfBarge
hex ( 48  91 115  72  52  95 117  74) (8   9  10) simpleGrading ( 1 1 1) // 2nd layer widthSide frontOfBarge
hex ( 52  95 117  74  56  99 119  76) (8   9  10) simpleGrading ( 1 1 1) // 3rd layer widthSide frontOfBarge
hex ( 56  99 119  76  60 103 121  78) (8   9  10) simpleGrading ( 1 1 1) // 4th layer widthSide frontOfBarge
hex ( 60 103 121  78  64 107 123  80) (8   9  10) simpleGrading ( 1 1 1) // 5th layer widthSide frontOfBarge
hex ( 64 107 123  80  68 111 125  82) (8   9   5) simpleGrading ( 1 1 1) // 6th layer widthSide frontOfBarge


hex ( 84  85  86  87  88  89  90  91) (8   1  15) simpleGrading (1 1 1) // bottom symmetryPlane outlet
hex ( 88  89  90  91  92  93  94  95) (8   1  10) simpleGrading (1 1 1) // 2nd layer symmetryPlane outlet
hex ( 92  93  94  95  96  97  98  99) (8   1  10) simpleGrading (1 1 1) // 3rd layer symmetryPlane outlet
hex ( 96  97  98  99 100 101 102 103) (8   1  10) simpleGrading (1 1 1) // 4th layer symmetryPlane outlet
hex (100 101 102 103 104 105 106 107) (8   1  10) simpleGrading (1 1 1) // 5th layer symmetryPlane outlet
hex (104 105 106 107 108 109 110 111) (8   1   5) simpleGrading (1 1 1) // 6th layer symmetryPlane outlet


hex ( 87  86 112 113  91  90 114 115) (8    9  15) simpleGrading (1 1 1) // bottom widthSide outlet
hex ( 91  90 114 115  95  94 116 117) (8    9  10) simpleGrading (1 1 1) // 2nd layer widthSide outlet
hex ( 95  94 116 117  99  98 118 119) (8    9  10) simpleGrading (1 1 1) // 3rd layer widthSide outlet
hex ( 99  98 118 119 103 102 120 121) (8    9  10) simpleGrading (1 1 1) // 4th layer widthSide outlet
hex (103 102 120 121 107 106 122 123) (8    9  10) simpleGrading (1 1 1) // 5th layer widthSide outlet
hex (107 106 122 123 111 110 124 125) (8    9   5) simpleGrading (1 1 1) // 6th layer widthSide outlet



);

edges
(
);

boundary
(

    outlet
    {
        type patch;
        faces
        (	// SymmetryPlane side
            ( 0  4  7  3)
			( 4  8 11  7)
			( 8 12 15 11)
			(12 16 19 15)
			(16 20 23 19)
			(20 24 27 23)


			// Back
			( 3  7 31 29)
			( 7 11 33 31)
			(11 15 35 33)
			(15 19 37 35)
			(19 23 39 37)
			(23 27 41 39)

            
        );
    }
    inlet
    {
        type patch;
        faces
        (	// symmetrySide
            ( 85  86  90  89)
			( 89  90  94  93)
			( 93  94  98  97)
			( 97  98 102 101)
			(101 102 106 105)
			(105 106 110 109)


			// Back
			( 86 112 114  90)
			( 90 114 116  94)
			( 94 116 118  98)
			( 98 118 120 102)
			(102 120 122 106)
			(106 122 124 110)

        );
    }
  bottom
    {
        type symmetryPlane;
        faces
        (
            (  0   3   2   1)
			(  3  29  28   2)
			(  1   2  45  42)
			(  2  28  71  45)
			( 42  45  44  43)
			( 45  71  70  44)
			( 43  44  87  84)
			( 44  70 113  87)
			( 84  87  86  85)
			( 87 113 112  86)
    
            
        );
    }
    
    atmosphere
    {
        type patch;
        faces
        (
            ( 27  24  25  26)
			( 41  27  26  40)
			( 26  25  66  69)
			( 40  26  69  83)
			( 83  69  68  82)
			//( 69  68 66  67)
			//( 68  67 108 111)
			( 82  68 111 125)
			(111 108 109 110)
			(125 111 110 124)
            
        );
    }

    atmosphereFrontOfBarge
    {
        type patch;
        faces
        (
			( 68  67 108 111)
		   
        );
    }
    
    barge
    {
        type wall;
        faces
        (
            ( 62  66  69  65) // wake  
			( 64  68  67  63) // inlet
			( 65  69  68  64) // back
			( 65  64  63  62) // bottom
            
        );
    }

    back
    {
        type symmetryPlane;
        faces
        (
            ( 29  31  30  28)
			( 31  33  32  30)
			( 33  35  34  32)
			( 35  37  36  34)
			( 37  39  38  36)
			( 39  41  40  38)
			( 28  30  73  71)
			( 30  32  75  73)
			( 32  34  77  75)
			( 34  36  79  77)
			( 36  38  81  79)
			( 38  40  83  81)
			( 71  73  72  70)
			( 73  75  74  72)
			( 75  77  76  74)
			( 77  79  78  76)
			( 79  81  80  78)
			( 81  83  82  80)
			( 70  72 115 113)
			( 72  74 117 115)
			( 74  76 119 117)
			( 76  78 121 119)
			( 78  80 123 121)
			( 80  82 125 123)
			(113 115 114 112)
			(115 117 116 114)
			(117 119 118 116)
			(119 121 120 118)
			(121 123 122 120)
			(123 125 124 122)
        );
    }

    front
    {
        type symmetryPlane;
        faces
        (
            (  0   1   5   4)
			(  4   5   9   8)
			(  8   9  13  12)
			( 12  13  17  16)
			( 16  17  21  20)
			( 20  21  25  24)
			(  1  42  46   5)
			(  5  46  50   9)
			(  9  50  54  13)
			( 13  54  58  17)
			( 17  58  62  21)
			( 21  62  66  25)
			( 42  43  47  46)
			( 46  47  51  50)
			( 50  51  55  54)
			( 54  55  59  58)
			( 58  59  63  62)
			//( 62  63  67  66)
			( 43  84  88  47)
			( 47  88  92  51)
			( 51  92  96  55)
			( 55  96 100  59)
			( 59 100 104  63)
			( 63 104 108  67)
			( 84  85  89  88)
			( 88  89  93  92)
			( 92  93  97  96)
			( 96  97 101 100)
			(100 101 105 104)
			(104 105 109 108)
        );
    }

);


mergePatchPairs
(
);


// ************************************************************************* //
